app/views/courses/index.html.erb

	<ul id="list">
		<%for category in CourseCategory.all%>
---
SELECT `course_categories`.* FROM `course_categories` ORDER BY name