app/controllers/admin_controller.rb

    def reports
      @admin_section = true
      @page_title = "Reports"
      @courses = Course.paginate(:all, :per_page=>10, :page=>params[:page])
---
SELECT `courses`.* FROM `courses` ORDER BY title LIMIT 0, 10