app/controllers/content_blocks_controller.rb

  def index
    @content_blocks = ContentBlock.paginate(:all, :per_page=>20, :page=>params[:page])
---
SELECT COUNT(*) AS count_id FROM `content_blocks`
SELECT `content_blocks`.* FROM `content_blocks` ORDER BY name LIMIT 0, 10

  def create
    @content_block = ContentBlock.new(params[:content_block])
    @page_title = "New Content Block"
    @admin_section = true
    respond_to do |format|
      if @content_block.save
---
INSERT INTO `content_blocks` (`body`, `created_at`, `friendly_url`, `name`, `updated_at`) VALUES ('<p>\r\n	test</p>\r\n', '2010-10-21 19:36:36', 'test', 'test', '2010-10-21 19:36:36')