app/controllers/course_categories_controller.rb

SELECT `course_categories`.* FROM `course_categories` ORDER BY name LIMIT 0, 10
---
  def index
    @admin_section = true
    @page_title = "Course Categories"

    @course_categories = CourseCategory.paginate(:all, :per_page=>10, :page=>params[:page])

SELECT `course_categories`.* FROM `course_categories` WHERE (`course_categories`.`id` = 1) ORDER BY name LIMIT 1
---
  def edit
    @admin_section = true
    @course_category = CourseCategory.find(params[:id])

INSERT INTO `course_categories` (`created_at`, `name`, `updated_at`) VALUES ('2010-10-21 16:40:48', 'test', '2010-10-21 16:40:48')
---
  def create
    @course_category = CourseCategory.new(params[:course_category])
    @admin_section = true
    @page_title = "New Course Category"

    respond_to do |format|
      if @course_category.save

SELECT `course_categories`.* FROM `course_categories` WHERE (`course_categories`.`id` = 1) ORDER BY name LIMIT 1
---
  def update
    @course_category = CourseCategory.find(params[:id])

SELECT `course_categories`.* FROM `course_categories` WHERE (`course_categories`.`id` = 2) ORDER BY name LIMIT 1
DELETE FROM `course_categories` WHERE (`course_categories`.`id` = 2)
---
  def destroy
    @course_category = CourseCategory.find(params[:id])
    @course_category.destroy