app/controllers/courses_controller.rb

SELECT `courses`.* FROM `courses` ORDER BY title LIMIT 0, 10
---
  def index
     @course_category = CourseCategory.where(:id=>params[:course_category_id]).first unless params[:course_category_id].blank?

     if @course_category
       @courses = Course.active.where(:course_category_id=>params[:course_category_id]).page(params[:page]).per(10)
       #@courses = Course.active.where(:course_category_id=>params[:course_category_id]).paginate(:all, :per_page=>10, :page=>params[:page])
     else
       @courses = Course.active.page(params[:page]).per(10)

SELECT `courses`.* FROM `courses` WHERE (`courses`.`id` = 4) ORDER BY title LIMIT 1
SELECT `course_dates`.* FROM `course_dates` WHERE (`course_dates`.`id` = 27) ORDER BY course_date asc LIMIT 1
---
  def register

    @course = Course.find(params[:friendly_course_url])
    @page_title = "Register for " + @course.title
    @registrant = Registrant.new(params[:registrant])

    if request.post?

      if @registrant.save
        course_date = CourseDate.where(:id=>params[:course_date][:id]).first()

SELECT `courses`.* FROM `courses` WHERE (`courses`.`id` = 1) ORDER BY title LIMIT 1
---
  def show
    @course = Course.where(:id=>params[:id]).first