app/controllers/course_registrants_controller.rb

  def destroy
    @course_registrant = CourseRegistrant.find(params[:id])
    @course_registrant.destroy
---
SELECT `course_registrants`.* FROM `course_registrants` WHERE (`course_registrants`.`id` = 2) LIMIT 1
DELETE FROM `course_registrants` WHERE (`course_registrants`.`id` = 2)