app/controllers/instructors_controller.rb

    def index

      @page_title = 'Instructor Dashboard <span style="font-size:14px">for ' + current_user.name + '</span>'
      @instructor_section = true
      if params[:user]

          if current_user.update_attributes(params[:user])
---
UPDATE `users` SET `encrypted_password` = '$2a$10$YFwudXxSAaEkX9VbbW688.SgrPhdoc4/4R2eR1QYzRKB4aiqFZpYq', `password_salt` = '$2a$10$YFwudXxSAaEkX9VbbW688.', `updated_at` = '2010-10-22 17:13:29' WHERE (`users`.`id` = 4)