app/controllers/site_controller.rb

  def static_page
    content_block = ContentBlock.where(:friendly_url=>params[:friendly_url]).first
---
SELECT `content_blocks`.* FROM `content_blocks` WHERE (`content_blocks`.`friendly_url` = 'test') ORDER BY name LIMIT 1

  def on_site_training
    @page_title="On-Site Training"
    @on_site_training = OnSiteTraining.new
    if request.post?
      @on_site_training = OnSiteTraining.new(params[:on_site_training])
      if @on_site_training.valid?
        @on_site_training.save
---
INSERT INTO `on_site_trainings` (`created_at`, `name`, `updated_at`) VALUES ('2010-10-21 20:49:01', 'lk', '2010-10-21 20:49:01')