app/controllers/users_controller.rb

SELECT `users`.* FROM `users` ORDER BY last_name LIMIT 0, 10
---
  def index
    @page_title = "Users"
    @admin_section = true

    @users = User.paginate(:all,:per_page=>20, :page=>params[:page])

SELECT `users`.* FROM `users` WHERE ((users.name like '%%' or users.email like '%%')) AND ((admin is null or admin == 0) and (instructor is null or instructor == 0)) ORDER BY name LIMIT 0, 10
---
  def search
    @page_title = "Users"

    @admin_section = true
      search_term = '%' + params[:search_term] + '%'
      @users = User.by_search_term(search_term)
      if params[:role]
        @users = @users.admins if params[:role] == "admin"
        @users = @users.instructors if params[:role] == "instructor"
        @users = @users.general if params[:role] == "general"
      end

      @users = @users.paginate(:per_page=>20, :page=>params[:page])

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 0) ORDER BY last_name LIMIT 1
SELECT `courses`.* FROM `courses` WHERE (`courses`.`id` = 4) ORDER BY title LIMIT 1
---
  def show
    @page_title = "User Details"

    @admin_section = true
    @tabs = true

    @user = User.find(params[:id])

    @user_asset = UserAsset.new
    @user_asset.user_id = @user.id

    @courses = Course.where(:instructor_id=>@user.id) if @user.instructor?

SELECT `courses`.* FROM `courses` WHERE (`courses`.`id` = 4) ORDER BY title LIMIT 1
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 3) ORDER BY last_name LIMIT 1
SELECT `course_dates`.* FROM `course_dates` WHERE (`course_dates`.`id` = 27) ORDER BY course_date asc LIMIT 1
INSERT INTO `orders` (`created_at`, `session_id`, `total`, `transaction_id`, `updated_at`, `user_id`) VALUES ('2010-11-01 16:23:35', NULL, 0, NULL, '2010-11-01 16:23:35', 3)
INSERT INTO `order_items` (`course_date_id`, `course_id`, `created_at`, `offline_transaction_notes`, `order_id`, `price`, `quantity`, `transaction_id`, `updated_at`) VALUES (27, 4, '2010-11-01 16:23:35', 'sdfdsf', NULL, NULL, NULL, NULL, '2010-11-01 16:23:35')
INSERT INTO `course_registrants` (`course_date_id`, `course_id`, `created_at`, `registration_date`, `status`, `updated_at`, `user_id`) VALUES (27, 4, '2010-11-01 16:18:51', '2010-11-01', NULL, '2010-11-01 16:18:51', 3)
---
  def add_to_course
    @admin_section = true
    @tabs = true

    @page_title = "Add User to Course"


    @course = Course.find(params[:course_id]) if params[:course_id]
    @user = User.find(params[:user_id])

    if params[:course_date_id]
      @course_date = CourseDate.find(params[:course_date_id])

      order = Order.create(:user_id=>@user.id,  :total=>0)
      order_item = OrderItem.create(:course_id=>@course_date.course_id, :course_date_id=>params[:course_date_id],:offline_transaction_notes=>params[:offline_transaction_notes])
      order.order_items << order_item

      @course_registrant = CourseRegistrant.create(:course_id=>@course_date.course_id, :course_date_id=>params[:course_date_id], :registration_date=>Time.now().to_date, :user_id=>@user.id)

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 3) ORDER BY last_name LIMIT 1
---
  def edit
    @admin_section = true
    @page_title = "Edit User"

    @user = User.find(params[:id])

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) ORDER BY name LIMIT 1
UPDATE `users` SET `address` = 'Andy Milk', `city` = 'Andy Milk', `instructor` = 0, `name` = 'Andy Milk', `phone` = 'Andy Milk', `state` = 'Andy Milk', `updated_at` = '2010-10-19 15:45:32', `zip` = 'Andy Milk' WHERE (`users`.`id` = 1)
---
  def update
    @page_title = "Edit User"
    @admin_section = true

    upload if params[:id]=="upload"

    params[:user_id].present? ? @user = User.find(params[:user_id]) :  @user = User.find(params[:id])

    #need to refactor this
    if params[:role] == 'admin'
      @user.instructor = false
      @user.admin = true
    end
    if params[:role] == 'instructor'
      @user.instructor = true
      @user.admin = false
    end
    if params[:role] == 'general'
      @user.instructor = false
      @user.admin = false
    end

    respond_to do |format|

      if params[:user].present?
        if @user.update_attributes(params[:user])

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 2) ORDER BY name LIMIT 1
DELETE FROM `users` WHERE (`users`.`id` = 2)
---
  def destroy

    @user = User.where(:id=>params[:id]).first
    @user.destroy